djraval/ESP32-C6-LCD-1.47-Template/sdkconfig.defaults
# ESP32-C6-LCD-1.47 Minimal Template Configuration
#
# Essential settings for the Waveshare ESP32-C6-LCD-1.47 development board

# Target Configuration
CONFIG_IDF_TARGET="esp32c6"
CONFIG_LV_COLOR_16_SWAP=y

# Flash Configuration (4MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# LVGL Optimizations
CONFIG_LV_BUILD_EXAMPLES=n

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Memory Configuration — custom partition table gives the app 2 MB so WiFi + BLE fit
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Driver optimizations for better performance
CONFIG_SPI_MASTER_ISR_IN_IRAM=y
CONFIG_LEDC_ISR_IRAM_SAFE=y
CONFIG_RMT_ISR_IRAM_SAFE=y

# --- Bluetooth (NimBLE) for WiFi provisioning over BLE -------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y

# --- WiFi provisioning service -------------------------------------------
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_WIFI_PROV_BLE_SEC_CONN=y

# LVGL additional optimizations
CONFIG_LV_MEM_CUSTOM=y

# FreeRTOS optimization
CONFIG_FREERTOS_HZ=1000
